# 11.- CÓMO crear un Data Frame

In [2]:
# Importar libreria
import pandas as pd # pd es la abreviación de pandas.
import numpy as np # np es la abreviación de numpy.



# 1.- Creando un Data Frame usando Arrays

## 1.1.- Opción 1

In [3]:
# Creando un array
data = np.array([[1,4], [2,5], [3,4]])

In [5]:
# Creando un Data Frame
df = pd.DataFrame(data, index = ['row1','row2','row3'],columns = ['col1','col2'])

In [6]:
# Mostranto el Data Frame
df

      col1  col2
row1     1     4
row2     2     5
row3     3     4

## 1.2.- Opción 2

In [7]:
# Creando un array en forma de lista
data = [[1,4], [2,5], [3,4]]

In [8]:
# Creando un Data Frame
df = pd.DataFrame(data, index = ['row1','row2','row3'],columns = ['col1','col2'])

In [9]:
# Mostrando el Data Frame
df

      col1  col2
row1     1     4
row2     2     5
row3     3     4


# 2.- Creando un Data Frame usando Diccionarios

In [10]:
# Listas usadas para el ejemplo
Estados = ['Califormia', 'Texas', 'Florida', 'New York']
Poblacion = [39613493, 29730311, 21944577, 19299981]

In [11]:
# Almacenando listas en un diccionario
dict_estados = {'Estados':Estados, 'Poblacion': Poblacion}

In [13]:
# Creando el Data Frame
df_poblacion = pd.DataFrame(dict_estados)

In [14]:
# Mostranto el Data Frame
df_poblacion

      Estados  Poblacion
0  Califormia   39613493
1       Texas   29730311
2     Florida   21944577
3    New York   19299981

# 3.- Creando un Data Frame usando archivos CSV

In [16]:
# Leyendo el archivo CSV
df_examenes = pd.read_csv('StudentsPerformance.csv')

In [17]:
# Mostrando el Data Frame
df_examenes

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86